/*
 * ========================= scriptMain_call.cpp ==========================
 *                          -- tpr --
 *                                        创建 -- 2018.12.28
 *                                        修改 -- 2018.12.28
 * ----------------------------------------------------------
 *  调用 脚本层的 入口函数
 *  本文件看起来有些多余
 * ----------------------------
 */
extern void scriptMain();

namespace src{ //------------------ namespace: src -------------------------//

void call_scriptMain(){
    scriptMain();
}

}//---------------------- namespace: src -------------------------//

