/*
 * ========================= scriptMain_call.cpp ==========================
 *                          -- tpr --
 *                                        CREATE -- 2018.12.28
 *                                        MODIFY -- 
 * ----------------------------------------------------------
 *  调用 脚本层的 入口函数
 *  本文件看起来有些多余
 * ----------------------------
 */
#include "pch.h"
extern void scriptMain();

namespace esrc {//------------------ namespace: esrc -------------------------//

void call_scriptMain(){
    scriptMain();
}

}//---------------------- namespace: esrc -------------------------//

