/*
 * ========================= scriptMain.h ==========================
 *                          -- tpr --
 *                                        创建 -- 2018.12.28
 *                                        修改 -- 2018.12.28
 * ----------------------------------------------------------
 *   script／脚本区 入口文件
 *   - 这个h文件将被 游戏引擎 include 
 *    （这意味着，如果本文件被丢弃，游戏将无法运行）
 *   - 本文件中，必须存在 void scriptMain(); 函数
 *    （同样的，如果这个函数被丢弃，游戏也将无法运行）
 * ----------------------------
 */
#ifndef _TPR_SCRIPT_MAIN_H_
#define _TPR_SCRIPT_MAIN_H_

//-------------------- CPP --------------------//
#include <functional> 

//-------------------- Engine --------------------//
#include "Engine/resource/srcs_manager.h" //- 所有资源



//----------- 需要注册的函数 ---------------//
void onGoSpecIds_SignUp();




/* ===========================================================
 *                     scriptMain 
 * -----------------------------------------------------------
 * -- 脚本层 入口函数
 * -- 常见功能： 将一些 脚本层函数 注册到 引擎中。
 */
void scriptMain(){

    //------- AwakeFuncs -------//
    src::behaviour.signUp_AwakeFuncs( std::bind( &onGoSpecIds_SignUp ) );






}













#endif

