/*
 * ========================= GameMesh.cpp ==========================
 *                          -- tpr --
 *                                        创建 -- 2018.11.24
 *                                        修改 -- 2018.11.24
 * ----------------------------------------------------------
 *   GameMesh 类, 可以看作 图元类。
 *   一个 GameMesh，负责管理 一张 矩形图元
 * ----------------------------
 */
#include "GameMesh.h" 

//-------------------- Engine --------------------//
#include "srcs_engine.h"


/* ===========================================================
 *                 bind_action
 * -----------------------------------------------------------
 */
void GameMesh::bind_action( const std::string &_name ){
    actionName = _name;
    actionPtr = &(esrc::actions.at(_name));
}

