/*
 * =================== chunkRelease.cpp =======================
 *                          -- tpr --
 *                                        CREATE -- 2019.07.11
 *                                        MODIFY -- 
 * ----------------------------------------------------------
 */
#include "chunkRelease.h"


//-------------------- Engine --------------------//
#include "tprAssert.h"
#include "Chunk.h"

namespace chunkRelease {//------- namespace: chunkRelease ----------//



/* ===========================================================
 *                 release_chunk
 * -----------------------------------------------------------
 */
void release_chunk( chunkKey_t chunkKey_ ){

    //------------------------------//
    //         gameObjs
    // 清除 go 在 map 上的登记
    // 部分 go，需要存入 db，剩余go直接删除
    //------------------------------//


    //------------------------------//
    //        chunk.texture
    // 删除 opengl 中的 有关对象
    // 删除 renderpool 中的 mesh
    //------------------------------//


    //------------------------------//
    //         fields
    // 删除所有 field 实例
    //------------------------------//

    

    //------------------------------//
    //         chunk
    // 删除 chunk 实例本身
    //------------------------------//


    //------------------------------//
    //          ecoObj
    // 目前方案：永不删除，就留在那
    //------------------------------//
    //...

}





}//----------------- namespace: chunkRelease: end -------------------//

