/*
 * ========================= action_srcs_add.cpp ==========================
 *                          -- tpr --
 *                                        创建 -- 2018.11.23
 *                                        修改 -- 2018.11.23
 * ----------------------------------------------------------
 *    Action_SRC 资源的 加载
 * ----------------------------
 */
#include "Action_SRC.h"
#include "game_srcs.h"



/* ===========================================================
 *                     action_srcs_add
 * -----------------------------------------------------------
 * -- 在游戏初始化阶段，被调用。
 * -- 统一加载并初始化 所有 Action_SRC 资源
 */
void action_srcs_add(){

    action_srcs.clear();

    action_srcs.insert( {"dog_ack_01",  Action_SRC{ "/dog_ack_01.P.png", 65, 112, 3, 4, 17, 2 } } );










}




