/*
 * ========================= Dog_A.cpp ==========================
 *                          -- tpr --
 *                                        创建 -- 2018.12.23
 *                                        修改 -- 2018.12.23
 * ----------------------------------------------------------
 *   具象GameObj类 示范。
 * 
 * ----------------------------
 */
#include "Script/gameObjs/Dog_A.h"


//-------------------- CPP --------------------//
#include <functional>



/* ===========================================================
 *                         init
 * -----------------------------------------------------------
 * -- 应该在 调用 init 之前，创建 基础go实例（并添加到 全局容器中）
 * -- 尽量把 具象go类 做得 “工厂化” 一些。
 */
void Dog_A::init( GameObj *_goPtr ){

    assert( _goPtr != nullptr );
    goPtr = _goPtr;

    //-------- 绑定回调函数 ---------//
    //  注意，此处绑定存在严重错误！！！
    //  当 本实例销毁后，绑定出去的 函数对象，却保留了 此处的 this 这个指针
    //  且仍旧指向 原来的位置
    //  当 基础go类 调用 绑定函数，就会在此访问这个 this 指针。从而引发 内存泄漏
    //  
    //  目前仍在寻找 更好的 具象go函数 实现方法中。
    //
    goPtr->Update   = std::bind( &Dog_A::Update, (Dog_A*)this );   //- *** 严重错误 ***
    goPtr->BeAffect = std::bind( &Dog_A::BeAffect, (Dog_A*)this ); //- *** 严重错误 ***

    //-------- 格式化 go.binary ---------//
    goPtr->binary.clear();
    goPtr->binary.resize( sizeof(Dog_A_Binary) );
    binaryPtr = (Dog_A_Binary*)&(goPtr->binary[0]); //- 绑定到本地指针

    binaryPtr->HP = 100;
    binaryPtr->MP = 95;

    //-------- action ---------//
    goPtr->actionNames.push_back( "human_1" ); //- 待机动画







}




/* ===========================================================
 *                       bind
 * -----------------------------------------------------------
 * -- 在 “工厂”模式中，将本具象go实例，与 一个已经存在的 go实例 绑定。
 * -- 这个 go实例 的类型，应该和 本类一致。
 */
void Dog_A::bind( GameObj *_goPtr ){



}




/* ===========================================================
 *                        Update
 * -----------------------------------------------------------
 */
void Dog_A::Update(){

}



/* ===========================================================
 *                       BeAffect
 * -----------------------------------------------------------
 */
void Dog_A::BeAffect(){

}














