/*
 * ========================= ah.h ==========================
 *                          -- tpr --
 *                                        创建 -- 2019.01.01
 *                                        修改 -- 2019.01.01
 * ----------------------------------------------------------
 *   
 * ----------------------------
 */
#ifndef _TPR_AH_H_
#define _TPR_AH_H_

namespace actionHdle{//------------- namespace ActionHdle ----------------


void typeId_alloc();


}//----------------- namespace ActionHdle: end -------------------
#endif 

