//
//========================= rectangle.h ==========================
//                       -- OpenGL --
//                                        创建 -- 2018.11.21
//                                        修改 -- 2018.11.21
//----------------------------------------------------------
//    顶点数据 矩形片面 tmp
//
//----------------------------

#ifndef _TPR_RECTANGLE_H_
#define _TPR_RECTANGLE_H_


float rect_vertics[] = {
    0.5f, 0.5f, 0.0f,   // 右上角
    0.5f, -0.5f, 0.0f,  // 右下角
    -0.5f, -0.5f, 0.0f, // 左下角
    -0.5f, 0.5f, 0.0f   // 左上角
};

unsigned int rect_indices[] = { // 注意索引从0开始! 
    0, 1, 3, // 第一个三角形
    1, 2, 3  // 第二个三角形
};


#endif

